app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties"
---
  def index
    @properties = Property.all

SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @property = Property.find(params[:id])

INSERT INTO "properties" ("address", "zipcode", "city", "price", "size", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["address", "123"], ["zipcode", "123"], ["city", "123"], ["price", 123], ["size", 123], ["created_at", 2016-11-06 20:49:12 UTC], ["updated_at", 2016-11-06 20:49:12 UTC]]
---
  def create
    @property = Property.new(property_params)

    @property.save

SELECT "properties".* FROM "properties" WHERE (zipcode ILIKE '101' AND (price >= '123' AND 10000 >= price ) AND (num_bedrooms >= 0 AND num_bedrooms <= 100 ) AND property_type ILIKE '%') ORDER BY created_at DESC
---
  def search
    @properties = Property.all