app/controllers/welcome_controller.rb

    def index
        @property = Property.all
---
SELECT "properties".* FROM "properties"